class Car
  attr_writer :speed #это типа метод сеттор для инстанц переменной @speed
  attr_reader :speed #это метод геттор
  attr_accessor :speed # это и геттор и сеттор

  #метод конструктор - он выполняется при создании экземпляра класса!
  def initialize(speed = 0)
    @speed = speed
    speed
  end

  # Это методы класса
  def stop
    # @speed = 0
    #т.к. для speed у нас есть attr_* то мы можем не использовать @
    # но для присвоения значения переменной нужно использовать self.
    self.speed = 0
  end

  def go
    @speed = 13 #Это инстанц переменная, она доступна везде в этом классе
    speed = 40 #это локальная переменная, доступна только в этом методе
  end

  #это типа два метода геттор и сеттор, т.е. могут устанавливать значение и показывать
  # но для этого есть attr_accessor, attr_reader, attr_writer
  # def speed #пользователь не может получить доступ к @speed, для этого создается отдельный метод
  #   puts @speed
  # end
  # def speed=(speed)
  #   @speed = speed
  # end
  #------------------------------------------------
end