class Truck_2 < Car_2
  # унаследовал все классы от Car_2 и можно добавить новые или пеореопределить старые

  def loading
    #тут типа что-то новенькое...
  end

  def start_engine #т.е. переопределили не полностью
    puts "Click" #тут тоже может быть код перед тем как выполнить суперкласс
    super #сначла сделаем все то, что в супер классе
    puts "Wroooom!!!" #а потом добавим новое
  end

  protected

  def initial_rpm #переопределим полностью
    500
  end
end


#оставил его тут а вообще нужно в отдельный фаил вынести...
class Driver
  #в экземпляре класса Driver будет 
    def drive(car) #метод drive которому передадим другой экземпляр класс
      car.start_engine #и у этого экземпляра вызовим метод запуска двигателя
    end
  end