begin
  puts "Start"
  1/0
  puts "Finis"
rescue => exception # все ошибки!
# rescue StandardError => exception # указание типово ошибок
  puts "NO! #{exception.message}" # текст ошибки
  puts exception.backtrace # место где она произашла

  raise # повторно выбросить это исключение
  # raise "Типа комент"
  # raise RuntimeError, "Указан тип исключения"
  
rescue NoMemoryError => exception
  puts "No Memory!!!"
ensure # этот блок выполнинтся в любом случае
  puts "Always"
end

puts "Программа продолжает работать..."

# Можно без begin если это в методе! rescue

# Сделать несколько попыток в блоке rescue
retry if count < 3

# Регулярное выражение
regexp = /.+/ # должен быть 1 символ
"f" =~ regexp # верно вернет 0, nil если не верно... !~ будет возвращать true || false
# \d - цифра - например гос номер /^[а-яА-Я]{1}\d{3}[а-яА-Я]{2}$/
# /^[а-я]{1}\d{3}[а-я]{2}$/i - не чувствителен к регистру

[abc]	Один символ: a, b или c
[^abc]	Любой одиночный символ, кроме: a, b или c
[a-z]	Любой одиночный символ в диапазоне az
[a-zA-Z]	Любой одиночный символ в диапазоне az или AZ
^	Начало строки
$	Конец линии
\A	Начало строки
\z	Конец строки
.	Любой одиночный символ
\s	Любой пробельный символ
\S	Любой непробельный символ
\d	Любая цифра
\D	Любая не цифра
\w	Любой символ слова (буква, цифра, подчеркивание)
\W	Любой символ, не являющийся словом
\b	Любая граница слова
(...)	Захватите все, что закрыто
(a|b)	а или б
a?	Ноль или один из
a*	Ноль или более
a+	Один или несколько из
a{3}	Ровно 3 из
a{3,}	3 или более
a{3,6}	Между 3 и 6 часами